In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [5]:
#Display top 3 rosw

In [6]:
df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

In [7]:
#last  3 rows

In [8]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [9]:
#2. All Rows except last 2 rows

In [10]:
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [11]:
#all rows except first 3 rows

In [12]:
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [13]:
# 5. Find the shape of dataset

In [14]:
df1.shape

(7, 4)

In [15]:
print('Numbers of Row:-',df1.shape[0])
print('Numbers of Columns:-',df1.shape[1])

Numbers of Row:- 7
Numbers of Columns:- 4

In [16]:
df1['Marks'].shape

(7,)

In [17]:
#Get Information

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 356.0+ bytes

In [19]:
#check null values

In [20]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [21]:
#get overall statics of datframe

In [22]:
df1.describe()

           Marks
count   5.000000
mean   93.200000
std     7.628892
min    83.000000
25%    87.000000
50%    98.000000
75%    99.000000
max    99.000000

In [23]:
df1.describe(include='all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

In [24]:
#find unique values from the gender values

In [25]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [26]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [27]:
df1['Marks'].unique()

array([98., nan, 99., 87., 83.])

In [28]:
df1['Gender'].nunique()

2

In [29]:
# Display count of unque values in gender column

In [30]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [31]:
#Handling Missing Values

In [32]:
df1.dropna(how='any')

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [33]:
df1.fillna(0)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    0.0  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    0.0    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [34]:
df1['Marks']

0    98.0
1     NaN
2    99.0
3    87.0
4     NaN
5    83.0
6    99.0
Name: Marks, dtype: float64

In [35]:
df1['Marks']=df1['Marks'].fillna(df1['Marks'].mean())

In [36]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [37]:
#MArks Between 80 to 90

In [38]:
sum((df1['Marks']>=80) & (df1['Marks']<=90))

2

In [39]:
sum(df1['Marks'].between(80,90))

2

In [40]:
#NAme of the students with LOwest Marks

In [41]:
df1[df1['Marks'].min() == df1['Marks']]['Name']

5    Mittal
Name: Name, dtype: object

In [42]:
#Top 5 Student By their Marks

In [43]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [44]:
df1.nlargest(5,'Marks')[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [45]:
df1.sort_values(by='Marks',ascending=False).head()[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [46]:
#Find Average Values

In [47]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [48]:
df1['Marks'].mean()

np.float64(93.2)

In [49]:
df1['Marks'].min()

np.float64(83.0)

In [50]:
df1['Marks'].max()

np.float64(99.0)

In [51]:
#apply method

In [52]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [53]:
def marks(x):
    return x/2

In [54]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [55]:
df1

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [56]:
#Map Function

In [57]:
df1

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [58]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [59]:
df1

      Name  Marks  Gender               Email  Half_Marks  Male_Female
0  Priyang   98.0    Male   priyang@gmail.com        49.0            1
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6            0
2   Krisha   99.0  Female    krisha@gmail.com        49.5            0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5            1
4   Parshv   93.2    Male  parshv@hotmail.com        46.6            1
5   Mittal   83.0  Female    mittal@yahoo.com        41.5            0
6  Archana   99.0  Female   archana@yahoo.com        49.5            0

In [60]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [61]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [62]:
df1

      Name  Marks  Gender               Email  Half_Marks  Male_Female
0  Priyang   98.0    Male   priyang@gmail.com        49.0            1
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6            0
2   Krisha   99.0  Female    krisha@gmail.com        49.5            0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5            1
4   Parshv   93.2    Male  parshv@hotmail.com        46.6            1
5   Mittal   83.0  Female    mittal@yahoo.com        41.5            0
6  Archana   99.0  Female   archana@yahoo.com        49.5            0

In [63]:
#inplace

In [64]:
df1.drop('Male_Female',axis=1,inplace=True)

In [65]:
df1

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [66]:
df1.sort_values(by='Marks',ascending=False
               )

      Name  Marks  Gender               Email  Half_Marks
2   Krisha   99.0  Female    krisha@gmail.com        49.5
6  Archana   99.0  Female   archana@yahoo.com        49.5
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
5   Mittal   83.0  Female    mittal@yahoo.com        41.5

In [67]:
#Display Name and Marks Of the female students only

In [68]:
df1

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [69]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [70]:
df1[df1['Gender'].isin(["Female"])][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [73]:
#Rename the Marks COlumns

In [74]:
df1.rename(columns={"Marks":"Final Marks"})

      Name  Final Marks  Gender               Email  Half_Marks
0  Priyang         98.0    Male   priyang@gmail.com        49.0
1   Aadhya         93.2  Female    aadhya@gmail.com        46.6
2   Krisha         99.0  Female    krisha@gmail.com        49.5
3   Vedant         87.0    Male    vedant@yahoo.com        43.5
4   Parshv         93.2    Male  parshv@hotmail.com        46.6
5   Mittal         83.0  Female    mittal@yahoo.com        41.5
6  Archana         99.0  Female   archana@yahoo.com        49.5

In [75]:
#concate two dataset

In [76]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [77]:
df2 = pd.DataFrame ({'Name':'Anil','Marks':90,'Gender':'Male','Email':'anil@gmail.com'},index=[0])

In [79]:
df3=pd.concat([df1,df2])

In [80]:
df3

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com
0     Anil   90.0    Male      anil@gmail.com

In [81]:
#loc And Iloc

In [82]:
df1.loc[:,'Marks':'Gender']

   Marks  Gender
0   98.0    Male
1    NaN  Female
2   99.0  Female
3   87.0    Male
4    NaN    Male
5   83.0  Female
6   99.0  Female

In [83]:
df1.iloc[1,2]

'Female'

In [84]:
df1.iloc[:,2]

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [85]:
df1.iloc[1,:]

Name                Aadhya
Marks                  NaN
Gender              Female
Email     aadhya@gmail.com
Name: 1, dtype: object

In [86]:
df1.iloc[:,3]

0     priyang@gmail.com
1      aadhya@gmail.com
2      krisha@gmail.com
3      vedant@yahoo.com
4    parshv@hotmail.com
5      mittal@yahoo.com
6     archana@yahoo.com
Name: Email, dtype: object

In [87]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [93]:
df1['Name_Marks']=df1['Name'] + ',' +  df1['Marks'].apply(str)

In [94]:
df1

      Name  Marks  Gender               Email    Name_Marks
0  Priyang   98.0    Male   priyang@gmail.com  Priyang,98.0
1   Aadhya    NaN  Female    aadhya@gmail.com    Aadhya,nan
2   Krisha   99.0  Female    krisha@gmail.com   Krisha,99.0
3   Vedant   87.0    Male    vedant@yahoo.com   Vedant,87.0
4   Parshv    NaN    Male  parshv@hotmail.com    Parshv,nan
5   Mittal   83.0  Female    mittal@yahoo.com   Mittal,83.0
6  Archana   99.0  Female   archana@yahoo.com  Archana,99.0

In [96]:
#FInd The Highest Average Value As Per Gender

In [100]:
df1.groupby('Gender')['Marks'].mean().sort_values(ascending=False).to_frame()

            Marks
Gender
Female  93.666667
Male    92.500000

In [99]:
type(df1.groupby('Gender')['Marks'].mean().sort_values(ascending=False))

pandas.core.series.Series

In [101]:
type(df1.groupby('Gender')['Marks'].mean().sort_values(ascending=False).to_frame())

pandas.core.frame.DataFrame

In [102]:
#WHat Are The Top 5 Most Popular email address

In [103]:
df1

      Name  Marks  Gender               Email    Name_Marks
0  Priyang   98.0    Male   priyang@gmail.com  Priyang,98.0
1   Aadhya    NaN  Female    aadhya@gmail.com    Aadhya,nan
2   Krisha   99.0  Female    krisha@gmail.com   Krisha,99.0
3   Vedant   87.0    Male    vedant@yahoo.com   Vedant,87.0
4   Parshv    NaN    Male  parshv@hotmail.com    Parshv,nan
5   Mittal   83.0  Female    mittal@yahoo.com   Mittal,83.0
6  Archana   99.0  Female   archana@yahoo.com  Archana,99.0

In [104]:
df1['Email'].head()

0     priyang@gmail.com
1      aadhya@gmail.com
2      krisha@gmail.com
3      vedant@yahoo.com
4    parshv@hotmail.com
Name: Email, dtype: object

In [105]:
list1=[]
for email in df1['Email']:
    email.split('@')

In [109]:
#df1['Email'][0].split('@')[1]

In [110]:
list1=[]
for email in df1['Email']:
    list1.append(email.split('@')[1])

In [111]:
list1

['gmail.com',
 'gmail.com',
 'gmail.com',
 'yahoo.com',
 'hotmail.com',
 'yahoo.com',
 'yahoo.com']

In [112]:
df1['Temp']=list1

In [113]:
df1

      Name  Marks  Gender               Email    Name_Marks         Temp
0  Priyang   98.0    Male   priyang@gmail.com  Priyang,98.0    gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com    Aadhya,nan    gmail.com
2   Krisha   99.0  Female    krisha@gmail.com   Krisha,99.0    gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com   Vedant,87.0    yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com    Parshv,nan  hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com   Mittal,83.0    yahoo.com
6  Archana   99.0  Female   archana@yahoo.com  Archana,99.0    yahoo.com

In [114]:
df1['Temp'].value_counts()

Temp
gmail.com      3
yahoo.com      3
hotmail.com    1
Name: count, dtype: int64

In [118]:
df1['Email'].apply(lambda x:x.split('@')[1]).value_counts().head()

Email
gmail.com      3
yahoo.com      3
hotmail.com    1
Name: count, dtype: int64